Repository: marcosjunqueira/sonar-l10n-pt-omegat
Catalog: tm/usersguide-omegat.tmx
Source language: en_us
Languages: pt_br

source: Java SE Samples
pt_br: Exemplos Java SE

source: Provides Java SE application samples.
pt_br: Fornece exemplos de aplicações Java SE.

source: This module provides Java SE samples available through Sample Setup Wizard.
pt_br: Este módulo fornece exemplos de aplicações Java SE disponíveis através do Assistente de Definição de Exemplo.

source: Anagram Game
pt_br: Jogo de anagramas

source: GUI Form Examples
pt_br: Exemplos de formulários GUI

source: Document Editor
pt_br: Editor de documentos

source: Mars Rover Viewer
pt_br: Visualizador de veículo marciano

source: Client Editor
pt_br: Editor de clientes

source: Project Name and Location Panel
pt_br: Nome do Projeto e Painel de Localização

source: Name and Location
pt_br: Nome e local

source: Project Name:
pt_br: Nome do projeto:

source: SampleApplication{0}
pt_br: AplicacaoExemplo{0}

source: Project Location:
pt_br: Localização do projeto:

source: Browse...
pt_br: Procurar...

source: Project Folder:
pt_br: Pasta do projeto:

source: D
pt_br: X

source: Project Name
pt_br: Nome do projeto

source: Project Location
pt_br: Local do projeto

source: Browse Project Location
pt_br: Procurar a localização do projeto

source: Project Folder
pt_br: Diretório do projeto

source: Select Project Location
pt_br: Selecionar local do projeto

source: Project Name is not valid folder name.
pt_br: Nome do projeto não é um nome de diretório válido.

source: Project Folder already exists and is not empty.
pt_br: Diretório do projeto já existe e não está vazio.

source: Set as Main Project
pt_br: Definir como projeto principal

source: A simple game application built with basic Swing components such as JFrame, JLabel, and JTextField.
pt_br: Um jogo simples desenvolvido com componentes básicos do Swing, como JFrame, JLabel, e JTextField.

source: Also contains a JUnit test class.
pt_br: Também contém uma classe de teste JUnit.

source: A simple editor of client information.
pt_br: Um simples editor de informações do cliente.

source: Demonstrates use of Beans Binding.
pt_br: Demonstra o uso de Vinculação de beans.

source: Includes examples of converters and validators.
pt_br: Inclui exemplos de conversores e validadores.

source: The Java 2 Standard Edition Sample Projects.
pt_br: Projetos de exemplo da plataforma Java 2 Standard Edition.

source: Java GUI Form samples illustrating NetBeans GUI Builder features on three typical UI layouts commonly used by developers.
pt_br: Exemplos de formulários GUI em Java que ilustram os recursos do gerador de GUI do NetBeans, em três formatos tipicamente usados por desenvolvedores.

source: A simple image viewer adapted from the SingleFrameExample5 application that is packaged with the Swing Application Framework library.
pt_br: Um visualizador simples de imagens adaptado a partir da aplicação SingleFrameExample5, que é empacotada junto a biblioteca Swing Application Framework.

source: Demonstrates use of actions, background tasks, resource maps, and other framework features.
pt_br: Demonstra o uso de ações, tarefas em segundo plano, mapas de recursos e outras funcionalidades desse framework.

source: A simple text editor adapted from the DocumentExample application that is packaged with the Swing Application Framework library.
pt_br: Um editor de textos simples adaptado a partir da aplicação DocumentExample, que é empacotada junto a biblioteca Swing Application Framework.

source: Demonstrates use of actions, resource maps, and other framework features.
pt_br: Demonstra o uso de ações, mapas de recursos e outras funcionalidades deste framework.

source: Help &Contents
pt_br: &Conteúdo da ajuda

source: Timer
pt_br: Timer (temporizador)

source: General Online Help
pt_br: Ajuda online geral

source: Online documentation for the IDE.
pt_br: Documentação online para o IDE.

source: The General Online Help module (code-named usersguide) provides online and context-sensitive documentation for basic IDE features such as editing files, updating the IDE, and configuring the IDE.
pt_br: O módulo de Ajuda online (guia de uso) provê documentação online e sensível a contexto para os recursos básicos do IDE como edição de arquivos, atualização e configuração do IDE.

source: Help
pt_br: Ajuda
